{
  "threats": [
    {
      "Threat ID": "AWS_SM_001",
      "Threat Name": "Secrets Not Rotated",
      "Source": "Internal or External Client Using Stale Secrets",
      "Target": "AWS Secrets Manager",
      "Description": "Secrets not configured for rotation can become stale, increasing the risk of unauthorized disclosure or misuse.",
      "Mitigation": "Enable rotation in Secrets Manager and configure rotation intervals to meet compliance requirements.",
      "Service": "AWS Secrets Manager"
    },
    {
      "Threat ID": "AWS_SM_002",
      "Threat Name": "Failed Scheduled Rotation",
      "Source": "Misconfigured Rotation Process or Missing Rotation Lambda",
      "Target": "AWS Secrets Manager",
      "Description": "If a scheduled rotation fails (e.g., due to rotation function errors), secrets remain unrotated and vulnerable.",
      "Mitigation": "Monitor scheduled rotation status, ensure rotation Lambda is properly configured and has required permissions.",
      "Service": "AWS Secrets Manager"
    },
    {
      "Threat ID": "AWS_SM_003",
      "Threat Name": "Overdue Secrets Rotation",
      "Source": "Credentials Allowed to Age Too Long",
      "Target": "AWS Secrets Manager",
      "Description": "Secrets exceeding the maximum recommended days since rotation can lead to unauthorized use of outdated credentials.",
      "Mitigation": "Set a maximum age for secrets in Secrets Manager and enforce regular rotation intervals (e.g., 90 days).",
      "Service": "AWS Secrets Manager"
    },
    {
      "Threat ID": "AWS_SM_004",
      "Threat Name": "Unused Secrets",
      "Source": "Dormant or Decommissioned Applications",
      "Target": "AWS Secrets Manager",
      "Description": "Secrets unused for a prolonged period may indicate orphaned credentials, increasing exposure if leaked.",
      "Mitigation": "Regularly audit secrets for usage, remove or rotate unused secrets to minimize attack surface.",
      "Service": "AWS Secrets Manager"
    },
    {
      "Threat ID": "AWS_SM_005",
      "Threat Name": "Secrets Not Encrypted with CMK",
      "Source": "Unauthorized Parties with Access to AWS-managed Encryption",
      "Target": "AWS Secrets Manager",
      "Description": "Secrets not encrypted using a customer-managed KMS key (CMK) reduce the control over encryption and key rotation.",
      "Mitigation": "Configure secrets to use CMK for encryption, granting fine-grained control over key policies and rotations.",
      "Service": "AWS Secrets Manager"
    }
  ]
}
